noaaTideSoapResponse.xml

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><HighLowAndMetadata xmlns="https://opendap.co-ops.nos.noaa.gov/axis/webservices/highlowtidepred/wsdl"><stationId>9446484</stationId><stationName>Tacoma</stationName><latitude>47.27</latitude><longitude>-122.413</longitude><state>WA</state><dataSource>USDOC/NOAA/NOS/COOPS(Center for Operational Oceanographic Products and Services)</dataSource><COOPSDisclaimer>The official Tide and Tidal Current prediction tables are published annually on October 1, for the following calendar year. Tide and Tidal Current predictions generated prior to the publishing date of the official tables are subject to change. The enclosed data are based upon the latest information available as of the date of your request. Tide and Tidal Current predictions generated may differ from the official predictions if information for the station requested has been updated since the publishing date of the official tables.</COOPSDisclaimer><beginDate>20170801 00:00</beginDate><endDate>20170830 23:59</endDate><datum>MLLW</datum><unit>Feet</unit><timeZone>LST</timeZone><HighLowValues><item date="08/01/2017"><data><time>06:26</time><pred>1.422</pred><type>L</type></data><data><time>13:47</time><pred>9.11</pred><type>H</type></data><data><time>18:46</time><pred>6.491</pred><type>L</type></data></item><item date="08/02/2017"><data><time>00:09</time><pred>10.407</pred><type>H</type></data><data><time>07:16</time><pred>0.873</pred><type>L</type></data><data><time>14:52</time><pred>9.82</pred><type>H</type></data><data><time>20:02</time><pred>6.74</pred><type>L</type></data></item><item date="08/03/2017"><data><time>00:59</time><pred>10.186</pred><type>H</type></data><data><time>08:02</time><pred>0.369</pred><type>L</type></data><data><time>15:40</time><pred>10.425</pred><type>H</type></data><data><time>21:00</time><pred>6.713</pred><type>L</type></data></item><item date="08/04/2017"><data><time>01:46</time><pred>10.117</pred><type>H</type></data><data><time>08:42</time><pred>-0.074</pred><type>L</type></data><data><time>16:18</time><pred>10.859</pred><type>H</type></data><data><time>21:44</time><pred>6.571</pred><type>L</type></data></item><item date="08/05/2017"><data><time>02:28</time><pred>10.166</pred><type>H</type></data><data><time>09:19</time><pred>-0.447</pred><type>L</type></data><data><time>16:49</time><pred>11.152</pred><type>H</type></data><data><time>22:19</time><pred>6.366</pred><type>L</type></data></item><item date="08/06/2017"><data><time>03:08</time><pred>10.282</pred><type>H</type></data><data><time>09:55</time><pred>-0.732</pred><type>L</type></data><data><time>17:16</time><pred>11.368</pred><type>H</type></data><data><time>22:50</time><pred>6.084</pred><type>L</type></data></item><item date="08/07/2017"><data><time>03:46</time><pred>10.413</pred><type>H</type></data><data><time>10:30</time><pred>-0.9</pred><type>L</type></data><data><time>17:41</time><pred>11.563</pred><type>H</type></data><data><time>23:19</time><pred>5.695</pred><type>L</type></data></item><item date="08/08/2017"><data><time>04:25</time><pred>10.511</pred><type>H</type></data><data><time>11:05</time><pred>-0.9</pred><type>L</type></data><data><time>18:07</time><pred>11.759</pred><type>H</type></data><data><time>23:52</time><pred>5.184</pred><type>L</type></data></item><item date="08/09/2017"><data><time>05:06</time><pred>10.528</pred><type>H</type></data><data><time>11:42</time><pred>-0.673</pred><type>L</type></data><data><time>18:35</time><pred>11.944</pred><type>H</type></data></item><item date="08/10/2017"><data><time>00:28</time><pred>4.561</pred><type>L</type></data><data><time>05:50</time><pred>10.431</pred><type>H</type></data><data><time>12:19</time><pred>-0.165</pred><type>L</type></data><data><time>19:06</time><pred>12.083</pred><type>H</type></data></item><item date="08/11/2017"><data><time>01:08</time><pred>3.85</pred><type>L</type></data><data><time>06:39</time><pred>10.202</pred><type>H</type></data><data><time>12:59</time><pred>0.652</pred><type>L</type></data><data><time>19:39</time><pred>12.136</pred><type>H</type></data></item><item date="08/12/2017"><data><time>01:53</time><pred>3.089</pred><type>L</type></data><data><time>07:33</time><pred>9.853</pred><type>H</type></data><data><time>13:41</time><pred>1.759</pred><type>L</type></data><data><time>20:15</time><pred>12.075</pred><type>H</type></data></item><item date="08/13/2017"><data><time>02:42</time><pred>2.319</pred><type>L</type></data><data><time>08:34</time><pred>9.444</pred><type>H</type></data><data><time>14:27</time><pred>3.082</pred><type>L</type></data><data><time>20:54</time><pred>11.896</pred><type>H</type></data></item><item date="08/14/2017"><data><time>03:37</time><pred>1.567</pred><type>L</type></data><data><time>09:46</time><pred>9.103</pred><type>H</type></data><data><time>15:21</time><pred>4.481</pred><type>L</type></data><data><time>21:38</time><pred>11.624</pred><type>H</type></data></item><item date="08/15/2017"><data><time>04:36</time><pred>0.837</pred><type>L</type></data><data><time>11:12</time><pred>9.044</pred><type>H</type></data><data><time>16:28</time><pred>5.743</pred><type>L</type></data><data><time>22:31</time><pred>11.326</pred><type>H</type></data></item><item date="08/16/2017"><data><time>05:38</time><pred>0.118</pred><type>L</type></data><data><time>12:47</time><pred>9.45</pred><type>H</type></data><data><time>17:51</time><pred>6.585</pred><type>L</type></data><data><time>23:31</time><pred>11.103</pred><type>H</type></data></item><item date="08/17/2017"><data><time>06:41</time><pred>-0.585</pred><type>L</type></data><data><time>14:08</time><pred>10.197</pred><type>H</type></data><data><time>19:18</time><pred>6.801</pred><type>L</type></data></item><item date="08/18/2017"><data><time>00:35</time><pred>11.04</pred><type>H</type></data><data><time>07:40</time><pred>-1.216</pred><type>L</type></data><data><time>15:08</time><pred>10.963</pred><type>H</type></data><data><time>20:30</time><pred>6.496</pred><type>L</type></data></item><item date="08/19/2017"><data><time>01:37</time><pred>11.13</pred><type>H</type></data><data><time>08:35</time><pred>-1.681</pred><type>L</type></data><data><time>15:55</time><pred>11.577</pred><type>H</type></data><data><time>21:27</time><pred>5.914</pred><type>L</type></data></item><item date="08/20/2017"><data><time>02:35</time><pred>11.275</pred><type>H</type></data><data><time>09:26</time><pred>-1.886</pred><type>L</type></data><data><time>16:36</time><pred>12.001</pred><type>H</type></data><data><time>22:16</time><pred>5.221</pred><type>L</type></data></item><item date="08/21/2017"><data><time>03:30</time><pred>11.359</pred><type>H</type></data><data><time>10:13</time><pred>-1.772</pred><type>L</type></data><data><time>17:13</time><pred>12.253</pred><type>H</type></data><data><time>23:00</time><pred>4.511</pred><type>L</type></data></item><item date="08/22/2017"><data><time>04:22</time><pred>11.308</pred><type>H</type></data><data><time>10:58</time><pred>-1.321</pred><type>L</type></data><data><time>17:48</time><pred>12.358</pred><type>H</type></data><data><time>23:43</time><pred>3.835</pred><type>L</type></data></item><item date="08/23/2017"><data><time>05:14</time><pred>11.096</pred><type>H</type></data><data><time>11:41</time><pred>-0.557</pred><type>L</type></data><data><time>18:22</time><pred>12.332</pred><type>H</type></data></item><item date="08/24/2017"><data><time>00:26</time><pred>3.229</pred><type>L</type></data><data><time>06:06</time><pred>10.747</pred><type>H</type></data><data><time>12:24</time><pred>0.47</pred><type>L</type></data><data><time>18:57</time><pred>12.173</pred><type>H</type></data></item><item date="08/25/2017"><data><time>01:09</time><pred>2.719</pred><type>L</type></data><data><time>06:59</time><pred>10.307</pred><type>H</type></data><data><time>13:07</time><pred>1.685</pred><type>L</type></data><data><time>19:32</time><pred>11.872</pred><type>H</type></data></item><item date="08/26/2017"><data><time>01:54</time><pred>2.325</pred><type>L</type></data><data><time>07:56</time><pred>9.835</pred><type>H</type></data><data><time>13:52</time><pred>3.002</pred><type>L</type></data><data><time>20:10</time><pred>11.432</pred><type>H</type></data></item><item date="08/27/2017"><data><time>02:40</time><pred>2.054</pred><type>L</type></data><data><time>08:58</time><pred>9.404</pred><type>H</type></data><data><time>14:42</time><pred>4.313</pred><type>L</type></data><data><time>20:50</time><pred>10.88</pred><type>H</type></data></item><item date="08/28/2017"><data><time>03:30</time><pred>1.889</pred><type>L</type></data><data><time>10:10</time><pred>9.116</pred><type>H</type></data><data><time>15:43</time><pred>5.484</pred><type>L</type></data><data><time>21:35</time><pred>10.279</pred><type>H</type></data></item><item date="08/29/2017"><data><time>04:24</time><pred>1.783</pred><type>L</type></data><data><time>11:36</time><pred>9.113</pred><type>H</type></data><data><time>17:01</time><pred>6.332</pred><type>L</type></data><data><time>22:27</time><pred>9.733</pred><type>H</type></data></item><item date="08/30/2017"><data><time>05:22</time><pred>1.659</pred><type>L</type></data><data><time>13:03</time><pred>9.456</pred><type>H</type></data><data><time>18:32</time><pred>6.668</pred><type>L</type></data><data><time>23:27</time><pred>9.373</pred><type>H</type></data></item></HighLowValues></HighLowAndMetadata></soapenv:Body></soapenv:Envelope>